"Systems Navigator is an independent software consultancy firm with headquarters in Delft, The Netherlands. The firm is a global leader in advanced decision support technology. Since 2003, Systems Navigator is working around the globe for a wide range of customers on the most challenging projects.In the summer of 2003 Systems Navigator was founded by Rienk Bijlsma & Vincent de Gast. Having worked in the software industry since 1995 at various positions, they believed that customers could benefit from a company that was truly dedicated to the implementation of simulation & scheduling solutions. Starting from a home office, owning nothing more than a dog and a mortgage, Rienk & Vincent started this journey, brave and unafraid!The unique concept of Systems Navigator came to market with the launch of our Scenario Navigator software platform in 2006. This allowed clients to use simulation technology for decision support & scenario analysis on their own. Through smart & intuitive user interfaces on top of complex simulation & planning models, users are empowered to support their decisions using the outcome of models. Scenario Navigator has enabled customers to make better decisions on capital investment & planning ever since. At first only on the desktop, but since 2009 also in the cloud making Systems Navigator the 1st company to deploy simulation models on the World Wide Web.Systems navigator has two Directors, Rienk Bijlsma and Vincent De Gast.The Consultant Manager of Systems Navigator is Alssandro Nati.The Technology Manager of Systems Navigator is Mart Jansent.Rienk Bijlsma is working in this industry since 1995. Founded Systems Navigator in 2003 to explore new applications of simulation, scheduling & planning technology. Rienk continuously aspires to initiate new ventures & ideas that secure Systems Navigator as a global leader in decision support technology.What is the Experience of Rienk Bijlsma? Rienk holds a MSc degree in Aerospace Engineering from TU Delft, The Netherlands. Wide experience in selling and delivering simulation & scheduling solutions to a variety of industries. Experience in setting up new companies, generating new business Rienk founded Systems Navigator in 2003.Vincent de Gast joined Systems Navigator in 2004 to start the Projects & Consultancy business.What is the Experience of Vincent de Gast? Vincent holds a MSc in Transport and Logistics from the TU Delft, The Netherlands. During his studies he specialized in discrete event simulation. This is where he became passionate about simulation and scheduling solutions. After his graduation he joined Rockwell Automation as a simulation and scheduling consultant. Vincent joined Systems Navigator in 2004.Alessandro Nati joined Systems Navigator and has been working in this industry since 2007.What is the Experience of Alessandro Nati? Alessandro Nati holds a MSc in Management and Manufacturing from the University of Florence, Italy. Leads the Consultants team. Extensive experience in delivering simulation projects & scheduling solutions across a variety of industries. Worked globally in multicultural environments. Alessandro joined Systems Navigator as Consultant in 2007. After 10 years, Alessandro became Consultant Manager.Mart Jansen joined Systems Navigator and has been working in this industry since 2011.What is the Experience of Mart Jansen? Mart holds a MSc in Operational Research from the University of Amsterdam, The Netherlands. Over the course of several projects, Mart became more interested in developing algorithms and interactive visualizations. As the Product Owner of Dropboard, Mart is dedicated to making sure the development effort is focused on our core strengths: intuitive interactions, powerful algorithms and application of our in-depth domain knowledge. Mart joined Systems Navigator as a Simulation Consultant in 2011. After 7 years, Mart became Technology Manager.What are the services of Systems Navigator?Systems Navigator offers a wide variety of services to its clients from (customized) software delivery to complete project solutions. The companies solutions are designed for strategic, tactical and operational decision making and are developed using optimization, scheduling, simulation and/or cloud technology. The services can be listed as 1)Data Analysis 2) Model Building 3) Planning Solutions 4) Consultancy Services 5) Traninig & Support 6) Embedded Engineering.Systems Navigator offers 4 main products which can be listed under the titles of Dropboard, Scenario Navigator, Digital Twin and Simulation.What is Dropboard, a product of Systems Navigator?Through our in-house developed Dropboard technology we deliver Planning & Scheduling systems in a variety of industries. Our solutions range from annual delivery plan generation to the operational scheduling of processes. Dropboard is specifically designed for the maritime industry and is deployed at ports and liquid bulk terminals. We understand that ports and terminals each have its unique planning & scheduling challenges, which is why we've created three pre-configured versions of Dropboard. Each version focuses on a different scheduling challenge, but because of its modular design a bespoke version can be configured to fit the unique scope of every port or terminal. In 2021, one of our customers awarded Dropboard the Best Innovation Award.What is Scenario Navigator, a product of Systems Navigator?Advanced models are a key resource used to predict the future performance of a system. Scenario Navigator technology provides a decision support platform for enterprise wide deployment of complex models or so-called Digital Twins that will lead to smarter analytics & better decisions.What is Digital Twin, a product of Systems Navigator? The word digital twin is used within many different contexts and can include parts, components, assets or systems. At Systems Navigator, we develop digital twins for systems, where we use simulation models of factories, terminals, ports or even entire supply chains, and turn them into a digital twin of the system. For us, a digital twin is an operational decision support system that supports operators, planners, analysts and managers to make decisions based on an accurate prediction of the near future, depending on the measures and actions that are possible."
